In [37]:
# Pandas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import psycopg2
from config import password

# SQLAlchemy
from sqlalchemy import create_engine

# Create an engine that can talk to the database
engine = create_engine(f'postgresql+psycopg2://postgres:{password}@localhost:5432/EmployeeDB')

In [38]:
# Read employee table
employees_df = pd.read_sql("SELECT * FROM employees",engine)
employees_df.head()

   emp_no title_id  birth_date  first_name  last_name sex   hire_date
0  473302    s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053    e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444    e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786    s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238    e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [39]:
# Read salary table
salaries_df = pd.read_sql("SELECT * FROM salaries",engine)

salaries_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [40]:
# Read title table
titles_df = pd.read_sql("SELECT * FROM titles",engine)

titles_df

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [41]:
# Count how many times each salary appears in the employee table
count_salaries = salary_groups['salary'].count()

print(count_salaries)

salary
40000     95346
40001         5
40002        10
40003         9
40004         9
          ...
125469        1
126703        1
127041        1
127238        1
129492        1
Name: salary, Length: 50355, dtype: int64

In [42]:
# Print MY EMPLOYEE INFO....HAHAHAHA
my_info_df = pd.read_sql("SELECT * FROM employees WHERE emp_no = '499942'",engine)
print(my_info_df)

   emp_no title_id  birth_date first_name last_name sex   hire_date
0  499942    e0004  1963-01-10      April  Foolsday   F  1997-02-10